<a href="https://colab.research.google.com/github/alfafimel/IPWK3-CORE/blob/main/SRS_IPWK3_CORE_ELIZABETH_JOSEPHINE_PYTHON_NOTEBOOK.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# importing libraries
import pandas as pd
import numpy as np
import random

In [ ]:
# reading in the dataset
url = 'http://bit.ly/MedicalCitiesIncomeDataset'
df = pd.read_csv(url)
df.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [ ]:
# determining size of the data
df.shape

(150000, 6)

In [ ]:
# Selecting the sample 
df1 = df.sample(n = 30, replace="False")
print(df1)

        Number             City  Gender  Age    Income Illness
128912  128913  Washington D.C.  Female   64   75349.0      No
127603  127604  Washington D.C.    Male   37   82051.0      No
133200  133201        San Diego    Male   31   93887.0      No
118462  118463           Boston  Female   39   81846.0      No
46836    46837    New York City    Male   42   99863.0      No
6127      6128           Dallas  Female   45   48132.0      No
145826  145827           Austin    Male   42   98141.0      No
41222    41223    New York City    Male   31   96900.0      No
118194  118195           Boston    Male   52  101313.0      No
21928    21929    New York City  Female   55  109374.0      No
142735  142736           Austin    Male   57   89664.0      No
5033      5034           Dallas  Female   51   48714.0      No
27782    27783    New York City    Male   58  109619.0      No
44469    44470    New York City    Male   30  112006.0      No
23666    23667    New York City    Male   56  103877.0      No
118091  118092           Boston    Male   48  103688.0      No
135060  135061        San Diego  Female   31   89830.0      No
90326    90327      Los Angeles  Female   53   74583.0      No
11112    11113           Dallas    Male   38   42278.0      No
57870    57871    New York City    Male   30   98568.0      No
113936  113937    Mountain View  Female   34  116064.0     Yes
105615  105616    Mountain View    Male   27  145136.0      No
90776    90777      Los Angeles    Male   48   89607.0      No
146441  146442           Austin    Male   38   81106.0      No
46375    46376    New York City    Male   37  104520.0     Yes
43562    43563    New York City  Female   47  102448.0     Yes
139903  139904           Austin    Male   62   96600.0      No
112324  112325    Mountain View    Male   46  140547.0      No
115846  115847    Mountain View    Male   26  115013.0     Yes
65299    65300    New York City    Male   48  107713.0      No